export const MONTHS = [
  "Հունվար",
  "Փետրվար",
  "Մարտ",
  "Ապրիլ",
  "Մայիս",
  "Հունիս",
  "Հուլիս",
  "Օգոստոս",
  "Սեպտեմբեր",
  "Հոկտեմբեր",
  "Նոյեմբեր",
  "Դեկտեմբեր",
];

export const WEEKDAYS_SHORT = ["Երկ", "Երք", "Չրք", "Հնգ", "Ուրբ", "Շբթ", "Կիր"];

export const WEEKDAYS_FULL = [
  "Երկուշաբթի",
  "Երեքշաբթի",
  "Չորեքշաբթի",
  "Հինգշաբթի",
  "Ուրբաթ",
  "Շաբաթ",
  "Կիրակի",
];

export const APPOINTMENT_OPTIONS = [
  { value: "", label: "Ընտրի..." },
  { value: "lawer", label: "🕵️‍♀️​ Առանց փաստաբանի չեմ պատասխանի․․․" },
  {
    value: "opinion",
    label: "🤦‍♂️​ Քո մասին վատ կարծիք էի կազմել առանց ճանաչելու",
  },
  { value: "tasteless", label: "🤣​ Անճաշակ էի" },
  { value: "assistant", label: "🤦‍♀️​​ Էտ նմանակս տենցա,մեռավ ինձ խայտառակ անելով" },
  { value: "ready", label: "👼🏻​​ Պատրաստ չէի" },
  { value: "error", label: "🤦‍♀️​​ Տենց լինումա,ծրագիրա կախումա" },
  { value: "true", label: "🤣​​ Ես ընտրում եմ ճիշտ պատասխանը!" },
];

export const SUCCESS_MESSAGES = {
  lawer: "Եկեք տենամ։🕵️‍♀️",
  opinion: "Դե հիմա կարծիքդ փոխվեց, չէ՞։😏",
  tasteless: "Ես էլ, թխի թող գա։🖐️",
  assistant: "Առհամարհելով անցնողն էլ ուրեմն դու չես եղել։",
  ready: "Կլացեմ🤣։Մի արա",
  error: "Օվա թողել իմ կառոննի խոսքերը օգտագործես։🤦‍♀️",
  true: "Թեեե չգիտեի🤣👏։",
};

export const STEPS = [
  { id: 0 },
  { id: 1 },
  { id: 2 },
  { id: 3 },
  { id: 4 },
  { id: 5 },
  { id: 6 },
  { id: 7 },
];